export const departaments = [
  'Руководство',
  'Разработка',
  'Маркетинг',
  'Бухгалтерия',
  'Отдел кадров',
] as const;

export const jobTitles = [
  'Директор',
  'Финансовый директор',
  'Технический директор',
  'Директор по маркетингу',
  'Директор отдела кадров',

  'Руководитель команды разработки',
  'Младший разработчик',
  'Разработчик',
  'Старший разработчик',

  'Бухгалтер',
  'Старший бухгалтер',
  'Главный бухгалтер',

  'Менеджер по маркетингу и рекламе',
  'Бренд-амбассадор',
  'Аналитик',
  'Младший аналитик',
  'Старший аналитик',
  'SEO-специалист',
  'Таргетолог',
  'Копирайтер',

  'Менеджер по персоналу',
  'Инспектор по персоналу',
  'Рекрутер',
] as const;

export const jobsTitlesByDepartament: [number, number][] = [
  [0, 4],

  [5, 8],

  [9, 11],

  [12, 19],

  [20, 22],
];
